grevaillot/svd_tools/headers/STM32F3x4/rtc.h
/** @defgroup rtc_bkp1r BKP1R backup register
@{*/


#define RTC_BKP1R_BKP_SHIFT		0
#define RTC_BKP1R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp1r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp2r BKP2R backup register
@{*/


#define RTC_BKP2R_BKP_SHIFT		0
#define RTC_BKP2R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp2r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp3r BKP3R backup register
@{*/


#define RTC_BKP3R_BKP_SHIFT		0
#define RTC_BKP3R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp3r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp4r BKP4R backup register
@{*/


#define RTC_BKP4R_BKP_SHIFT		0
#define RTC_BKP4R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp4r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp5r BKP5R backup register
@{*/


#define RTC_BKP5R_BKP_SHIFT		0
#define RTC_BKP5R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp5r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp6r BKP6R backup register
@{*/


#define RTC_BKP6R_BKP_SHIFT		0
#define RTC_BKP6R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp6r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp7r BKP7R backup register
@{*/


#define RTC_BKP7R_BKP_SHIFT		0
#define RTC_BKP7R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp7r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp8r BKP8R backup register
@{*/


#define RTC_BKP8R_BKP_SHIFT		0
#define RTC_BKP8R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp8r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp9r BKP9R backup register
@{*/


#define RTC_BKP9R_BKP_SHIFT		0
#define RTC_BKP9R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp9r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp10r BKP10R backup register
@{*/


#define RTC_BKP10R_BKP_SHIFT		0
#define RTC_BKP10R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp10r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp11r BKP11R backup register
@{*/


#define RTC_BKP11R_BKP_SHIFT		0
#define RTC_BKP11R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp11r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp12r BKP12R backup register
@{*/


#define RTC_BKP12R_BKP_SHIFT		0
#define RTC_BKP12R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp12r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp13r BKP13R backup register
@{*/


#define RTC_BKP13R_BKP_SHIFT		0
#define RTC_BKP13R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp13r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp14r BKP14R backup register
@{*/


#define RTC_BKP14R_BKP_SHIFT		0
#define RTC_BKP14R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp14r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp15r BKP15R backup register
@{*/


#define RTC_BKP15R_BKP_SHIFT		0
#define RTC_BKP15R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp15r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp16r BKP16R backup register
@{*/


#define RTC_BKP16R_BKP_SHIFT		0
#define RTC_BKP16R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp16r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp17r BKP17R backup register
@{*/


#define RTC_BKP17R_BKP_SHIFT		0
#define RTC_BKP17R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp17r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp18r BKP18R backup register
@{*/


#define RTC_BKP18R_BKP_SHIFT		0
#define RTC_BKP18R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp18r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp19r BKP19R backup register
@{*/


#define RTC_BKP19R_BKP_SHIFT		0
#define RTC_BKP19R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp19r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp20r BKP20R backup register
@{*/


#define RTC_BKP20R_BKP_SHIFT		0
#define RTC_BKP20R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp20r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp21r BKP21R backup register
@{*/


#define RTC_BKP21R_BKP_SHIFT		0
#define RTC_BKP21R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp21r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp22r BKP22R backup register
@{*/


#define RTC_BKP22R_BKP_SHIFT		0
#define RTC_BKP22R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp22r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp23r BKP23R backup register
@{*/


#define RTC_BKP23R_BKP_SHIFT		0
#define RTC_BKP23R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp23r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp24r BKP24R backup register
@{*/


#define RTC_BKP24R_BKP_SHIFT		0
#define RTC_BKP24R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp24r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp25r BKP25R backup register
@{*/


#define RTC_BKP25R_BKP_SHIFT		0
#define RTC_BKP25R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp25r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp26r BKP26R backup register
@{*/


#define RTC_BKP26R_BKP_SHIFT		0
#define RTC_BKP26R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp26r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp27r BKP27R backup register
@{*/


#define RTC_BKP27R_BKP_SHIFT		0
#define RTC_BKP27R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp27r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp28r BKP28R backup register
@{*/


#define RTC_BKP28R_BKP_SHIFT		0
#define RTC_BKP28R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp28r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp29r BKP29R backup register
@{*/


#define RTC_BKP29R_BKP_SHIFT		0
#define RTC_BKP29R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp29r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp30r BKP30R backup register
@{*/


#define RTC_BKP30R_BKP_SHIFT		0
#define RTC_BKP30R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp30r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_bkp31r BKP31R backup register
@{*/


#define RTC_BKP31R_BKP_SHIFT		0
#define RTC_BKP31R_BKP_MASK		0xffffffff
/** @defgroup rtc_bkp31r_bkp BKP BKP
@{*/
/**@}*/


/**@}*/
